In [1]:
import pandas as pd
import numpy as np
from word2number import w2n

In [2]:
df = pd.read_csv("C://Users//Dhana//vicky files//Untitled Folder//py-master//py-master//ML//2_linear_reg_multivariate//Exercise//hiring.csv")
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [3]:
df.experience = df.experience.fillna('zero')
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [4]:
df.experience = df.experience.apply(w2n.word_to_num)
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    NaN                           7      72000
7          11                    7.0                           8      80000

In [5]:
import math
test_fill = df['test_score(out of 10)'].mean()

In [6]:
df['test_score(out of 10)'] = df['test_score(out of 10)'].fillna(test_fill)

In [7]:
X = df.drop('salary($)', axis = 'columns')
X

   experience  test_score(out of 10)  interview_score(out of 10)
0           0               8.000000                           9
1           0               8.000000                           6
2           5               6.000000                           7
3           2              10.000000                          10
4           7               9.000000                           6
5           3               7.000000                          10
6          10               7.857143                           7
7          11               7.000000                           8

In [8]:
y = df['salary($)']
y

0    50000
1    45000
2    60000
3    65000
4    70000
5    62000
6    72000
7    80000
Name: salary($), dtype: int64

In [9]:
from sklearn.linear_model import LinearRegression

C:\Users\Dhana\anaconda3\lib\site-packages\scipy\__init__.py:138: UserWarning: A NumPy version >=1.16.5 and <1.23.0 is required for this version of SciPy (detected version 1.23.0)
  warnings.warn(f"A NumPy version >={np_minversion} and <{np_maxversion} is required for this version of "

In [10]:
from sklearn.model_selection import train_test_split

In [18]:
X_train, X_test, y_train, y_test = train_test_split(X,y, test_size = 0.2, random_state = 0)

In [19]:
X_train

   experience  test_score(out of 10)  interview_score(out of 10)
1           0                    8.0                           6
7          11                    7.0                           8
3           2                   10.0                          10
0           0                    8.0                           9
5           3                    7.0                          10
4           7                    9.0                           6

In [20]:
X_test

   experience  test_score(out of 10)  interview_score(out of 10)
6          10               7.857143                           7
2           5               6.000000                           7

In [21]:
lr = LinearRegression()

In [22]:
lr.fit(X_train, y_train)

LinearRegression()

In [23]:
lr.predict(X_test)

array([77818.23189204, 57496.5574222 ])

In [24]:
lr.score(X_test, y_test)

0.44279101264009224

In [28]:
print(lr.coef_, lr.intercept_)

[3107.68383365 2575.59900854 2184.5221702 ] 11212.889011291656

In [29]:
lr.coef_

array([3107.68383365, 2575.59900854, 2184.5221702 ])

In [30]:
lr.intercept_

11212.889011291656